# На вход программе подается натуральное число
# n. Напишите программу, которая создает список, состоящий из делителей введенного числа.


n = int(input())
string = []
count_1 = 0
count_2 = 1

for i in range(n):
    enter_string = int(input())

        string.append(i)

print(string)

